OpFile/AirandTemV2/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inLetAir
    {
        type            patch;
        nFaces          2500;
        startFace       1187688;
    }
    outLetAir
    {
        type            patch;
        nFaces          2500;
        startFace       1190188;
    }
    yFront
    {
        type            patch;
        nFaces          2500;
        startFace       1192688;
    }
    yBack
    {
        type            patch;
        nFaces          2500;
        startFace       1195188;
    }
    groundWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2500;
        startFace       1197688;
    }
    topWall
    {
        type            patch;
        nFaces          2500;
        startFace       1200188;
    }
)

// ************************************************************************* //
