OpFile/AirandTemV2/0/airRegion/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0/airRegion";
    object      cellToRegion;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];
internalField   uniform ( 0.1 0 0 );

boundaryField
{
    inLetAir
    {
        type            fixedValue;
        value           uniform ( -1 0 0 );
        phi             phi;
    }
    outLetAir
    {
        type            pressureInletOutletVelocity;
        value           uniform ( 0 0 0 );
        phi             phi;
    }
    yFront
    {
        type            pressureInletOutletVelocity;
        value           uniform ( 0 0 0 );
        phi             phi;
    }
    yBack
    {
        type            pressureInletOutletVelocity;
        value           uniform ( 0 0 0 );
        phi             phi;
    }
    groundWall
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
        phi             phi;
    }
    topWall
    {
        type            pressureInletOutletVelocity;
        value           uniform ( 0 0 0 );
        phi             phi;
    }
    airRegion_to_panel
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
        phi             phi;
    }
}


// ************************************************************************* //
