OpFile/AirandTemV2/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// The topoSetDict comprises a list of actions to perform on different
// set types (cellSet, faceSet, pointSet, etc).
//
// Each action is a dictionary with e.g.
//     // Name of set
//     name    c0;
//
//     // type: pointSet/faceSet/cellSet/faceZoneSet/cellZoneSet
//     type    cellSet;
//
//     // action to perform on set. Two types:
//     // - require no source : clear/invert/remove
//     //       clear  : clears set or zone
//     //       invert : select all currently non-selected elements
//     //       remove : removes set or zone
//     // - require source    : new/add/subtract/subset
//     //       new    : create new set or zone from source
//     //       add    : add source to contents
//     //       subtract : subtract source from contents
//     //       subset : keeps elements both in contents and source
//     action  new;
//
// The source entry varies according to the type of set.
//
// In OpenFOAM 1806 and earlier, it was compulsory to use a 'sourceInfo'
// sub-dictionary to define the sources.
// In OpenFOAM 1812 and later, this sub-directory is optional, unless
// there would be a name clash (Eg, 'type' or 'name' appearing at both levels).
// In most cases, the source definitions have been adjusted to avoid such
// clashes.
//
// More detailed listing in the annotated topoSetSourcesDict

// system/topoSetDict
actions
(
    // 1. 创建包含所有单元格的集合
    {
        name    allCells;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box     (-1e150 -1e150 -1e150) (1e150 1e150 1e150);
        }
    }

    {
    name    airRegion;
    type    cellSet;
    action  new;
    source  cellToCell;
    sourceInfo
    {
        set     allCells;  // 缩进对齐、无多余括号、格式正确
    }
    }

    // 3. 从airRegion中减去panel
    {
        name    airRegion;
        type    cellSet;
        action  subtract;
        source  cellToCell;
        sourceInfo
        {
            set     panel1;
        }
    }

    // 4. 将cellSet转为cellZone
    {
        name    airRegion;
        type    cellZoneSet;
        action  new;
        source  cellToCellZone;  // 注意Z是大写
        sourceInfo
        {
            set     airRegion;
        }
    }
);
// ************************************************************************* //
